var story = [
    '<div><h2 class="title">'
    +'想说的话'+'</h2>'
    +'<p>太多话想说</p>'
    +'<p>有时候忍不住想找你搭话，直到你发出来的“拉黑”警告，每次想到你发送时候皱眉扶额时的表情就觉得很是可爱，233</p>'
    +'<p>最想说的就是感谢和抱歉：感谢遇到你，然后为过去、现在以及将来可能给你带来的烦恼表示抱歉</p>'
    +'<p>嗯，很想可以给你带来一辈子烦恼 </p>'
    +'<p>真的忘了，从什么时候开始的</p>'
    +'<p>还记得，你穿着那套衣服站在那里说：“大家好，我是程宏虹，可以叫我大橙子。。。”</p>'
    +'<p>那时我还在敲代码，扫了一眼，跟小黑说：“额，怎么来了个大妈？”</p>'
    +'<p>后来你穿了一次，被我吐槽了，然后就再没穿过了，抱歉，但是真的好想笑，2333</p>'
    +'<p>一直想找一个能带我玩的人，一起开心地做每一件事，互相促进，互相学习</p>'
    +'<p>这里不得不提一下她了，我以为她是，但结果不是，我觉得那我应该尽力去影响她（或者说改变她），但结果是失败，我不是超人，我连自己都改变不了，也没用资格去改变别人</p>'
    +'<p>至今喝醉了两次，第一次大一寒假高中同学聚会，第二次你知道。两次喝醉整个人切换了一次状态。我以为2016是十分失败的，但是突然绝对也是不错的，明确的自己想要什么了，知道严格要求自己了，知道怎么做了。</p>'
    +'<p>年轻的时候简单说想要一个能带我玩的，现在看来，我想要的一直都是一种感觉：跟她在一起，我就觉得我可以做到任何事情的感觉</p>'
    +'<p>现在，我找到了</p>'
    +'<p>年初告诉自己成为一名“战士”，已经做了一个月了，状态良好</p>'
    +'<p>然后前几天我又加了一个：“追求你“</p>'
    +'<p>一年以后，你没结婚，做我女朋友吧！</p>'
    +'<p>也许两年？三年？十年？ </p>'
    +'</div>',

    '<div><h2 class="title">'
    +'想问的事'+'</h2>'
    +'<p>2月7、8号为什么每月来？</p>'
    +'<p>情人节在做什么？</p>'
    +'<p>被降职是因为什么？是不是心情还是很低落？</p>'
    +'<p>还去健身房吗？</p>'
    +'<p>有没有好书推荐？</p>'
    +'<p>有没有好歌曲推荐？</p>'
    +'<p>有没有好电影推荐？</p>'
    +'<p>能不能一起去看电影？</p>'
    +'<p>能不能明天陪我买一块生日蛋糕？</p>'
    +'<p>。。。</p>'
    +'<p>太多问题想问，如果可以，想请你允许我每天，不！每周，不！每月问你一个问题。</p>'
    +'<p>2月，我想问：“可以告诉我你的手机号吗？”</p>'
    +'</div>',

    '<div><h2 class="title">'
    +'你很美'+'</h2>'
    +'<p>你很美，不止样貌</p>'
    +'<p>好吧，我承认在我看来你很漂亮（记得之前你说我，看不出来你的漂亮是不懂得欣赏，我怎么可能看不出来，只是不能，一遍遍告诉你自己你和我无关，你好看与否也跟我无关，想极力摆脱你对我的影响）</p>'
    +'<p>漂亮的女生天生自信，你也是（但是没有到我这种极度自信接近自负的程度），这很好</p>'
    +'<p>你很会打扮（我看来是），但是你的身材还是对你有些限制，你有小肚子哦（希望你不会觉得我是个“变态”，不然我“死“得冤啊），如果我是你的男朋友，我是不会要你减肥的，健康就好，会打扮就可以了。</p>'
    +'<p>为什么你会懂得生活中那么多的小细节呢？这是我最喜欢的一点。不是很想谈这个，因为你懂这些，有可能是因为别人教的，能教一个女人的男人，只有两个爸和男友，希望不是后一个。</p>'
    +'<p>你皱着眉头的样子很有意思，一种想生气却生不起来的样子，可能因为我们关系一般，所以你很好地控制自己地情绪，就行你说的：“不让大家尴尬”</p>'
    +'<p>你懂得怎么花钱，合理的生活理念，追求合理的生活品质，我一直希望我可以做到，希望我的她可以做到（可惜失败了一次）。</p>'
    +'<p>。。。</p>'
    +'<p>你很美，真的</p>'
    +'<p>如果将来心情低落，遭遇挫折，来这里看看，你还是你，那个自信，可爱，认真，美丽的你</p>'
    +'<p>而这里</p>'
    +'<p>一直有一个男生</p>'
    +'<p>祝愿你幸福，开心每一天</p>'
    +'</div>',

    '<div><h2 class="title">'
    +'命中注定'+'</h2>'
    +'<p>不是什么唯心论，而是从科学角度来说，这是一件注定的事，只要我们相遇</p>'
    +'<p>基因决定相貌，这个大家都知道</p>'
    +'<p>性格也是由基因决定的，你可能不信，但是这是事实，科学家们得出这个结论当然不能拿人做实验了，所以他们收集大量同卵双胞胎（他们基因几乎完全相同，就是那些几乎一模一样的双胞胎）的相关信息，最后发现：这些双胞胎，不管环境怎样，最终的性格都是近似的</p>'
    +'<p>所以我喜欢什么样的，从我出生，甚至我没出生就已经注定了</p>'
    +'<p>幸运的是，我遇到了，而且我意识到了</p>'
    +'<p>你说，我该怎么做呢？</p>'
    +'</div>',

    '<div><h2 class="title">'
    +'男人和女人'+'</h2>'
    +'<p>男人一生中最重要的两个女人：母亲、妻子</p>'
    +'<p>女人一生中最重要的两个男人：父亲、丈夫</p>'
    +'<p>所以一定要明白自己想要什么</p>'
    +'<p>我明白自己的</p>'
    +'<p>我想你应该知道自己的</p>'
    +'</div>',

    '<div><h2 class="title">'
    +'我想我快要死了'+'</h2>'
    +'<p>不和你说话的日子里，我感觉快要死了，就跟小鱼离开了水</p>'
    +'<p>做俯卧撑完全没有力气了</p>'
    +'<p>周一，不知道为什么，突然感觉你对我刻意疏远</p>'
    +'<p>也许是我让你感到讨厌了吧</p>'
    +'<p>所以我克制自己，尽量不去跟你搭话</p>'
    +'<p>好痛苦</p>'
    +'<p>午饭你好像也在刻意回避</p>'
    +'<p>看你将所有经历投入到了工作</p>'
    +'<p>担心你的身体</p>'
    +'<p>所以明天你会在桌子上看到一个苹果</p>'
    +'<p>一张纸条：“苹果无罪，一天一水果，一天一开心”（写的时候改成“An apple a day keeps the doctors away! 苹果无罪，如果觉得尴尬，就心里说声Thank you！）</p>'
    +'<p>设想了无数中你看到以后的结果</p>'
    +'<p>最差的就是你直接扔到我脸上</p>'
    +'<p>最希望，你拿着苹果走到我面前</p>'
    +'<p>问：“你放的？”</p>'
    +'<p>我说：“嗯”</p>'
    +'<p>然后你微笑着说：“哦，谢了啊”</p>'
    +'<p>渐渐地，喜欢你已经成为我的一部分</p>'
    +'<p>让我知道自己还活着</p>'
    +'<p>没有你了，我真的快要死了</p>'
    +'</div>',

    '<div><h2 class="title">'
    +'苹果、幸福和不想对你说“对不起”'+'</h2>'
    +'<p>我想我今天还是快要死了</p>'
    +'<p>高兴得要死了</p>'
    +'<p>送你一个苹果，得到了比我最好的预期还要好的结果</p>'
    +'<p>可惜当时带着耳机，没有听清你是怎么喊住我的</p>'
    +'<p>幸福就是比预期得到的多</p>'
    +'<p>那一刻我是幸福的</p>'
    +'<p>幸福得快死了</p>'
    +'<p>盛极必衰也许同样适用于感情</p>'
    +'<p>几个小时后</p>'
    +'<p>心里渐渐被不安占据</p>'
    +'<p>在感到和你拉近距离的同时</p>'
    +'<p>不安也悄然到来</p>'
    +'<p>我担心看到一个不一样的你</p>'
    +'<p>一个也许我没有现在这么喜欢的你</p>'
    +'<p>一个也许甚至我会讨厌的你</p>'
    +'<p>渴望靠近，却又害怕你不是你</p>'
    +'<p>你说过“人生内无贤父兄，外无严师友，而能有成者少矣“</p>'
    +'<p>我想我可以帮助你</p>'
    +'<p>你问过“你管我啊？”</p>'
    +'<p>我想我可以的</p>'
    +'<p>本就是人生中最重要的人，本就应该互相“管”，互相促进，共同进步</p>'
    +'<p>也许真有那一天</p>'
    +'<p>你答应了我，但是却没有一起努力</p>'
    +'<p>不想对你说“对不起”</p>'
    +'<p>也许是我对不起你，没有好好努力</p>'
    +'<p>也许是我对不起你，没有“停下来”等你</p>'
    +'<p>。。。</p>'
    +'<p>不要让我对你说“对不起”</p>'
    +'<p>答应我，永远做你自己，你就是你，你还是你，你永远都是你</p>'
    +'<p>谢谢！</p>'
    +'</div>',

    '<div><h2 class="title">'
    +'后面的都是一些我自己的'+'</h2>'
    +'<p>很高兴你看到了这里</p>'
    +'<p>本来很想自信地说：“你如果看到了这里，就不是完全拒绝我，我一定会让你爱上我的！”</p>'
    +'<p>突然不想说了</p>'
    +'<p>就是喜欢你，一种感觉，简简单单的，看不见摸不到，但它就是存在</p>'
    +'<p>也许你并不会看到这里，甚至永远都不会</p>'
    +'<p>也许你已经把我拉黑了</p>'
    +'<p>也许。。。</p>'
    +'<p>设想了无数种可能情况</p>'
    +'<p>无数种未来</p>'
    +'<p>唯一没变的还是那一种感觉</p>'
    +'<p>谢谢！</p>'
    +'<p>抱歉！</p>'
    +'</div>',

    '<div><h2 class="title">'
    +'假如明天我就要死了'+'</h2>'
    +'<p>假如明天我就要死了</p>'
    +'<p>今天我该做些什么呢</p>'
    +'<p>我想我不会泡在游戏里的</p>'
    +'<p>顶多上去把一些值钱的东西邮寄给我的朋友们</p>'
    +'<p>我想我也不会照常上班</p>'
    +'<p>工作是无趣的、耗时的</p>'
    +'<p>不对</p>'
    +'<p>我还是要去上班的</p>'
    +'<p>只有这样才能见你一面</p>'
    +'<p>接着应该也会去写遗书吧</p>'
    +'<p>第一封写给妈妈</p>'
    +'<p>感谢妈妈十月怀胎赐予我生命</p>'
    +'<p>第二封写给爸爸</p>'
    +'<p>感谢爸爸含辛茹苦养育我成长</p>'
    +'<p>第三封写给崔同学</p>'
    +'<p>信里写满我对她的忏悔、我对她的祝福</p>'
    +'<p>并告诉他我曾经也是开心的</p>'
    +'<p>第四封写给你</p>'
    +'<p>一片空白</p>'
    +'<p>不给你带去一丝烦恼</p>'
    +'<p>让我在那边</p>'
    +'<p>如果那时我还有一点财产</p>'
    +'<p>那就留给爸妈</p>'
    +'<p>爸妈帮我寄一部分给崔同学</p>'
    +'<p>抱歉</p>'
    +'<p>我想应该不多</p>'
    +'<p>不能给你了</p>'
    +'<p>但是我会在那边用心祝福你</p>'
    +'<p>后记：</p>'
	+'<p>迷惘的时候，告诉自己：明天就要死了</p>'
	+'<p>也许有一天意外发生了，就让这里做我的坟吧</p>'
    +'</div>',

    '<div><h2 class="title">'
    +'我'+'</h2>'
    +'<p>每个人都活在自己的世界里</p>'
    +'<p>也活在别人的世界里</p>'
    +'<p>我的世界里</p>'
    +'<p>我是一只想很多事的猪</p>'
    +'<p>真的想了很多</p>'
    +'<p>但是好多做不到，毕竟我只是一只猪</p>'
    +'<p>最后我的行为就变得逗逼了</p>'
    +'<p>每日依旧趴在围栏上，看着外面，心里想着</p>'
    +'<p>有一天</p>'
    +'<p>他遇到了自己生活的目标</p>'
    +'<p>收拾好自己的猪圈，背起了行囊，开启了新的旅程</p>'
    +'<p>我的世界里</p>'
    +'<p>有一个姑娘</p>'
    +'<p>她漂亮美丽</p>'
    +'<p>她热爱生活</p>'
    +'<p>她可爱迷人</p>'
    +'<p>她也许有着丁香一样的颜色、丁香一样的芬芳</p>'
    +'<p>她的名字也许和你一样</p>'
    +'<p>也是程宏虹</p>'
    +'</div>',

    '<div><h2 class="title">'
    +'你很美'+'</h2>'
    +'<p>你很美</p>'
    +'<p>但是也可能已经为他人绽放</p>'
    +'<p>也可能是别人帮你美的</p>'
    +'<p>我看到了</p>'
    +'<p>但是</p>'
    +'<p>晚了</p>'
    +'<p>注定</p>'
    +'<p>晚</p>'
    +'</div>',
];

var touchStartX = '',
    touchStartY = '',
    touchEndX = '',
    touchEndY = '',
    storyIdx = 0;
function handleTouchEvent(event) {
    if (1 || 2 == event.touches.length) {
        switch(event.type) {
            case 'touchstart':
                touchStartX = event.changedTouches[0].clientX;
                touchStartY = event.changedTouches[0].clientY;
                break;
            case 'touchend':
                touchEndX = event.changedTouches[0].clientX;
                touchEndY = event.changedTouches[0].clientY;

                diffY = Math.abs(touchEndY - touchStartY);
                if (diffY > 100) {
                    break;
                }

                if (touchStartX && touchStartY && touchEndX && touchEndY) {
                    diff = touchEndX - touchStartX;
                    diffStand = 50;
                    if (diff < diffStand) {
                        if (storyIdx >= (story.length-1)) {
                            storyIdx = story.length-1;
                        } else {
                            storyIdx++;
                        }
                    } else if (diff > -diffStand) {
                        if (storyIdx <= 0) {
                            storyIdx = 0;
                        } else {
                            storyIdx--;
                        }
                    }
                    letter.innerHTML = story[storyIdx];
                }
                touchStartX = touchStartY = touchEndX = touchEndY = '';
                break;
        }
    }
}

var letter = document.getElementById('letter');
letter.addEventListener("touchstart", handleTouchEvent, false);
letter.addEventListener("touchend", handleTouchEvent, false);
letter.innerHTML = story[storyIdx];
